app/controllers/sessions_controller.rb

INSERT INTO "users" ("uid", "name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["uid", 1.0103445069819276e+16], ["name", "Derek Kaknes"], ["email", "derek.kaknes@gmail.com"], ["created_at", "2017-04-03 23:49:50.277490"], ["updated_at", "2017-04-03 23:49:50.277490"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", 1.0103445069819276e+16]]
---
  def create
    @user = User.find_or_create_by(uid: auth['uid']) do |u|