app/controllers/welcome_controller.rb

  def home
    if session[:user_id]
      @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]